Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Procedures for an Incoming Message ........................15 5.2.
ja: 受信メッセージのための手順 ........................15 5.2.

source: SSH maintains its own group identifier space, which is logically distinct from Oakley [RFC2412] and IKE; however, for one additional group, the Working Group adopted the number assigned by [RFC3526], using "diffie-hellman-group14-sha1" for the name of the second defined group.
ja: SSHは, Oakley [RFC2412] や IKE と論理的に異なる, 自身の群識別子を維持している. しかし, 追加の群として, ワーキンググループは[RFC3526] で割当てられた数を採用した. この2つ目の群の名前として, "diffie-hellman-group14-sha1" を用いる.

source: The SSH authentication protocol [SSH-USERAUTH] is a general-purpose user authentication protocol.
ja: SSH 認証プロトコル [SSH-USERAUTH] は, 汎用のユーザ認証プロトコルだ.

source: The server can then determine whether the client is using an old protocol, and can revert to the old protocol if required.
ja: そしてサーバは, クライアントが古いプロトコルを利用するかどうかを決定し必要ならば古いプロトコルに戻すことができる.

source: Each field is a line of the following format:
ja: 各行は, 以下の形式の行だ.

source: Signatures are encoded as follows:
ja: 署名は次のようにエンコードされる:

source: This protocol has been designed to operate with almost any public key format, encoding, and algorithm (signature and/or encryption).
ja: このプロトコルは, 公開鍵フォーマット, エンコーディング, アルゴリズム (署名と/ないし暗号化) のほとんどのものと共に動作するように設計されている.

source: Implementations MAY support any ASN.1 object identifier (OID) in the ASN.1 object tree that defines a set of elliptic curve domain parameters [ASN1].
ja: 実装は, 楕円曲線ドメインパラメータの集合を定義する ASN.1 オブジェクトツリーのすべての ASN.1 オブジェクト識別子(OID)をサポートしてもよい.[ASN1].

source: Even with a Public Key Infrastructure (PKI) in place, it is useful to have a standard for exchanging short fingerprints of public keys.
ja: 公開鍵基盤(PKI)でも実施されているように, 公開鍵の短い指紋を交換する標準があると便利だ.

source: The recommended values for min and max are 1024 and 8192, respectively.
ja: min と max の推奨値はそれぞれ 1024 と 8192 だ.

source: Such lines MUST NOT begin with "SSH-", and SHOULD be encoded in ISO-10646 UTF-8 [RFC3629] (language is not specified).
ja: これらの行は, "SSH-" で始まってはならない. また,ISO-10646 UTF-8 [RFC3629] でエンコーングされている必要がある(言語は特定されない).

source: The shared secret value K, the exchange hash H, and all the above symmetric keys will be updated.
ja: 共有の秘密の値 K と交換ハッシュ H, 上記のすべての対称鍵が更新される.

source: Even in the cases of authentication where no user credentials are divulged, an attacker may still gain information they shouldn't have by capturing key-strokes in much the same way that a honeypot works.
ja: ユーザの認証資格を漏らさない認証の場合でも, 攻撃者はハニーポットと同様の働きにおりキーストロークをキャプチャし得られるべきではない情報を取得するかもしれない.

source: If they are displayed, control character filtering, as discussed in [SSH-ARCH], SHOULD be used.
ja: もし表示されるなら, [SSH-ARCH] で議論されているように, 制御文字のフィルタリングが利用される必要がある.

source: For this reason, condition (2) of Section 2.2 requires that all users of SecSh-B MUST be authenticated using ECDSA-256/384 signatures and X.509v3 certificates.
ja: この理由から, 2.2 節の 条件 (2) は, ECDSA-256/384 署名と X.509v3 証明書を用いて SecSh-B のすべてのユーザが認証されなければならないことを要求する.

source: Another method defined in the SSH Architecture [6] uses local files to store keys for comparison.
ja: SSH アーキテクチャ [6] に別の方法が定義されている. その方法は, 鍵を保存するローカルファイルを比較のために使う.

source: Security Capabilities of this Model ........................8 3.1.1.
ja: このモデルのセキュリティ機能 ........................8 3.1.1.

source: Many computer systems treat serial consoles as local and secured, and interpret a BREAK signal as an instruction to halt execution of the operating system or to enter privileged configuration modes.
ja: 多くの計算機システムは, シリアルコンソールをローカルで安全なものと取り扱う. そして BREAK 信号を オペレーティングシステムの中断の実施や特権設定モードへ進入の指示として解釈する.

source: This protocol also needs to know whether the lower- level protocol provides confidentiality protection.
ja: プロトコルは, 下層のプロトコルが機密性の保護を提供するかどうかを知る必要もある.

source: The 'x11 authentication protocol' is the name of the X11 authentication method used, e.g., "MIT-MAGIC-COOKIE-1".
ja: 'x11 authentication protocol' は, 利用するX11の認証法の名前だ. 例, "MIT-MAGIC-COOKIE-1".

source: The SSH Transport Model will establish a channel between itself and the SSH Transport Model of another SNMP engine.
ja: SSH トランスポートモデルは, 別の SNMP エンジンの SSH トランスポートモデルと自分自身の間にチャンネルを確立する.

source: Any context established during key exchange for the purpose of rekeying MUST NOT be used with this method.
ja: 鍵の再生成目的での鍵交換で確立したコンテキストは, この方法に利用してはならない.

source: All implementations SHOULD support password authentication.
ja: すべての実装は, パスワード認証をサポートする必要がある.

source: Given the potential of adversarial tampering with this data, system-specific measures (e.g., Access Control Lists, UNIX permissions, other Discretionary and/or Mandatory Access Controls) SHOULD be used to protect these files.
ja: データに対する悪意のある改善の可能性を考慮して, これらのファイルを保護するためにシステム固有の方法(例えば, アクセスコントロールリスト, UNIXのパーミッション, その他の任意 及び/もしくは 強制のアクセス制限)を利用する必要がある.

source: Many 'channel type' values have extensions that are specific to that particular 'channel type'.
ja: 多くの 'channel type' の値が, 特定の 'channel type' に特有の拡張を持つ.

source: control processing needs to be performed by a notification originator before notifications are actually sent, and this processing is done using the configured securityName.
ja: 通知が実際に送られる前に, 通知の発信者によって制御の処理が行なわれる必要がある. 設定された securityName を用いてこの処理が行なわれる.

source: There are some standard algorithms and methods that all implementations MUST support.
ja: すべての実装がサポートしなければならない, いくつかの標準アルゴリズムと方式がある.

source: Covert Channels
ja: コバートチャンネル(隠れチャンネル, プロトコルの想定外の手段で情報を伝えること)

source: The User-based Security Model (USM) [RFC3414] was designed to be independent of other existing security infrastructures to ensure it could function when third-party authentication services were not available, such as in a broken network.
ja: ユーザベースセキュリティモデル (USM) [RFC3414] は, ネットワークが切断した場合のような第三者の認証サービスが利用できない場合でも機能することを保証するよう, 既存の他のセキィリティ基盤に依存しないよう設計された.

source: The client MAY accept the host key without verification, but doing so will render the protocol insecure against active attacks; see the discussion in Section 4.1 of [RFC4251].
ja: クライアントは, 検証なしにホスト鍵を受けいれてもよい. しかし, これはプロトコルヲを能動的な攻撃に対して安全でなくしてしまう; [RFC4251] の 4.1節の議論を見よ.

source: If an error occurs on client side, the client can terminate the method by sending a new SSH_MSG_USERAUTH_REQUEST packet.
ja: クライアント側でエラーが起きたら， 新しい SSH_MSG_USERAUTH_REQUEST パケットをクライアントが送って現在の認証法を終了してよい．

source: GSS-API Considerations .........................................22 7.1.
ja: GSS-API の考察 .........................................22 7.1.

source: The key words "MUST" and "SHOULD" in this document are to be interpreted as described in [RFC2119].
ja: この文書でのキーワード "MUST", "SHOULD" は, [RFC-2119] で記述されているように解釈される.

source: The algorithm from the SHA2 family that will be used is chosen based on the size of the named curve specified in the public key:
ja: SHA2ファミリからどのアルゴリズムが選ばれるかは, 公開鍵に指定された曲線のサイズを元に決められる.

source: The thirteen encryption algorithm names defined in Section 4 have been added to the Secure Shell Encryption Algorithm Name registry established by Section 4.11.1 of [RFC4250].
ja: 4節で定義された13の暗号アルゴリズムモードは, [RFC4250] の 4.11.1 節で確立された Secure Shell Encryption Algorithm Name registry に追加されている.

source: 56 ECHONL Echo NL even if ECHO is off.
ja: 56 ECHONL ECHO が無効でも NL をエコーする.

source: The following method-specific message numbers are used by the password authentication method.
ja: パスワード認証法では, 次の認証法特有のメッセージ番号が使われる.

source: For the purposes of this document, it suffices to know that in X.509 a chain or sequence of certificates (possibly of length one) allows a trusted root certificate authority and its intermediate certificate authorities to cryptographically bind a given public key to a given digital identity using public key signatures.
ja: この文書の目的は, X.509 で 証明書の(おそらく長さ1の)チェーンないしシーケンスによって, 信頼されるルート認証局とその中間認証局が暗号学的に公開鍵署名を用いる電子IDと公開鍵が束縛できることを知ることだ.

source: Presentation Format of the SSHFP RR ........................5 4.
ja: SSHFP RR の 表示形式 ........................5 4.

source: However, if the id-ad-ocsp access description indicates that the certificate authority employs OCSP, and no OCSP response information is available, it is RECOMMENDED that the certificate be rejected.
ja: しかし, 認証局が OCSP を採用するよう id-ad-ocsp access description が指定したが OCSP 情報がない場合は, 証明書を拒否することが推奨される.

source: It provides strong encryption, server authentication, and integrity protection.
ja: このプロトコルは, 強力な暗号化, サーバの認証, 完全性の保護を提供する.

source: This protocol aims to be simple and uses only well-understood primitives.
ja: このプロトコルは単純であることを目指しており, よく知られたプリミティブのみを利用している.

source: This portion of the address will indicate the user name that should be used when authenticating to an SSH server.
ja: アドレスのこの部分は, SSH サーバに認証する際に用いられるユーザ名を指定する.

source: This section covers the constraints that the choice of minimum security level imposes upon the selection of a key agreement protocol (kex algorithm), encryption algorithm, and data integrity algorithm (MAC algorithm).
ja: この節は, 鍵合意プロトコル (kex アルゴリズム), 暗号化アルゴリズム, データ完全性アルゴリズム (MACアルゴリズム)にセキュリティ最小レベルの選択が課す制約をカバーする.

source: Key Words ..................................................3 2.
ja: キーワード ..................................................3 2.

source: Public Key Subsystem Overview .
ja: 公開鍵サブシステムの概要 .

source: A session is started by sending the following message.
ja: セッションは, 次のメッセージを送ることで開始される.

source: However, using the same name in multiple categories SHOULD be avoided to minimize confusion.
ja: しかし, 複数のカテゴリで同じ名前を使うことは, 混乱を最小限にするために避ける必要がある.

source: The session identifier uniquely identifies this session and is suitable for signing in order to prove ownership of a private key.
ja: セッション識別子はユニークにセッションを識別する. これは, 公開鍵の持ち主を証明するための署名に利用するのに適当だ.

source: Channel Mechanism
ja: チャンネルのメカニズム

source: For consistency with SNMP-related specifications, this document favors terminology as defined in STD 62, rather than favoring terminology that is consistent with non-SNMP specifications.
ja: SNMPに関係する仕様との一貫性のために, この文書は SNMP でない仕様と一貫した用語を利用するよりも STD 62 で定義された用語を優先する.

source: The transport layer provides forward secrecy for password authentication and other methods that rely on secret data.
ja: トランスポート層は, パスワード認証や他の秘密の情報に依存する認証法のために前方秘密性を提供する.

source: IANA Considerations ............................................12 9.
ja: IANA の考慮 ............................................12 9.

source: Encryption Algorithm Names
ja: 暗号アルゴリズム名

source: Initial Server Response ...................................14 3.4.
ja: 最初のサーバの応答 ...................................14 3.4.

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [2].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, [2] で記述されているように解釈される.

source: Private Exponents
ja: プライベート指数

source: The following table identifies the initial assignments of the Public Key Algorithm names.
ja: 次の表で, 公開鍵アルゴリズムの名前の初期の割り当てを示す.

source: When applicable, a field is also provided for a language tag [RFC3066].
ja: 可能な場合, 言語タグのためのフィールドも提供される. [RFC3066].

source: This format is the same as for ssh-dss signatures in Section 6.6 of [RFC4253].
ja: [RFC4253] の 6.6 節の ssh-dss 署名と, このフォーマットは同一だ.

source: A match occurs if the octet strings are identical for the reference identifier and any presented identifier.
ja: 参照識別子と提示された識別子がオクテット文字列で同一ならば, 一致している.

source: Public Key Algorithms Using X.509 Version 3 Certificates .
ja: X.509 バージョン 3 証明書を用いる公開鍵アルゴリズム .

source: The use of mnemonics instead of numbers is not allowed.
ja: 番号の代わりにニーモニックを使うのは許されない.

source: Future Assignments of Names
ja: 名前の将来の割り当て

source: Host-Based Authentication: "hostbased" .........................12 10.
ja: ホストベース認証: "hostbased"........................12 10.

source: Compression ................................................8 6.3.
ja: 圧縮...........................................8 6.3.

source: The chosen encryption algorithm to each direction MUST be the first algorithm on the client's name-list that is also on the server's name-list.
ja: それぞれの方向の選択される暗号化アルゴリズムは, サーバの名前リストに存在するものの中でクライアントの名前リストの最初にあるアルゴリズムでなければならない.

source: The Secure Shell (SSH) Protocol Architecture
ja: セキュア シェル (SSH) プロトコル アーキテクチャ

source: In general, the reply messages do not include request type identifiers.
ja: 一般に, この返答メッセージは要求の種類の識別子を含まない.

source: However, it is not illegal to include 'method name' values that cannot be used to authenticate the user.
ja: しかし, ユーザの認証に利用できない 'method_name'の値を含めることは違反ではない.

source: Requests for assignments of new Extended Channel Data Transfer 'data_type_code' values, and their associated Extended Channel Data Transfer 'data' strings, in the range of 0x00000002 to 0xFDFFFFFF, MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 拡張チャンネルデータ転送の 'data_type_code' の値と関連する拡張チャンネルデータ転送の 'data' を割り当てる要求は, 0x00000002 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS によってされなければならない.

source: It also derives a unique session ID that may be used by higher-level protocols.
ja: さらに, より上位のプロトコルで利用される, ユニークなセッションidを導出する.

source: There are also issues related to the maximum packet size.
ja: 最大のパケットサイズに関連する問題もある.

source: To have SNMP properly utilize the security services provided by SSH, the SSH Transport Model MUST be used with a Security Model that knows how to process a tmStateReference, such as the Transport Security Model for SNMP [RFC5591].
ja: SSHで提供されるセキュリティサービスを SNMP に利用させるために, SSH トランスポートモデルは,Transport Security Model for SNMP [RFC5591] のような tmStateReference の処理方法を知っている Security Model と共に利用されなければならない.

source: These terms are used as guidance for designers of proposed IETF models to make the designs compatible with RFC 3411 subsystems and Abstract Service Interfaces (ASIs).
ja: これらの用語は, RFC 3411 のサブシステムや Abstract Service Interfaces (ASIs) と互換性を持つ設計をするために提案されたIETF モデルの設計者へのガイドとして用いられる.

source: where the encoding of the elliptic curve point Q_C as an octet string is as specified in Section 2.3.3 of [SEC1].
ja: 楕円曲線のポイント Q_C のオクテット文字列としてのエンコーディングは, [SEC1] の 2.3.3 節で指定されている.

source: (Although there may be some network savings from padding to only 8-bytes even if the block cipher uses 16-byte blocks, because of (1) we do not make that recommendation here.)
ja: (16-byteブロックのブロック暗号の場合でさえパディングから8byteのネットワークの節約しかないので, (1) より ここでパディングの節約の推奨はしない.)

source: Currently, the amount of trust a user can realistically place in a server key is proportional to the amount of attention paid to verifying that the public key presented actually corresponds to the private key of the server.
ja: 現在, ユーザが現実的にサーバ鍵に起ける信頼の大きさは, サーバの秘密鍵と提示された公開鍵が実際に関係していることを検証するために払う注意の大きさと比例している.

source: Security Considerations .........................................6 7.
ja: セキュリティの考察 .........................................6 7.

source: After an SSH Transport Model channel is established, then SNMP messages can conceptually be sent through the channel from one SNMP Message Dispatcher to another SNMP Message Dispatcher.
ja: SSH トランスポートチャンネルが確立した後では, 概念的には, SNMP メッセージディスパッチャから別の SNMP メッセージディスパッチャに SNMP メッセージはこのチャンネルを通して送られる.

source: Any authentication method that meets the requirements of the SSH architecture will provide the properties of mutual authentication and binding of keys.
ja: SSH アーキテクチャの要求を満たすどの認証法も, 相互の認証と鍵の束縛の性質を提供する.

source: It is up to each domain how it manages its local namespace.
ja: ローカルな名前空間をどう管理するかは, それぞれのドメイン次第だ.

source: If compression has been negotiated, the 'payload' field (and only it) will be compressed using the negotiated algorithm.
ja: 圧縮が取り決められている場合は, 'payload' フィールド(のみ)は, 取り決められたアルゴリズムを用いて圧縮される.

source: Required Curves
ja: 必須の曲線

source: Control of Function through Configuration and Policy
ja: 設定とポリシーによる機能の管理

source: System administrators should be cautious when enabling curves other than the ones specified in Section 10 and should make a more detailed investigation into the security of the curve in question.
ja: システム管理者は, 10節で指定されたもの以外の曲線を有効にするときに注意する必要がある.. また, 問題の曲線のセキュリティについてよく詳しい調査する必要がある.

source: o "127.0.0.1" and "::1" indicate listening on the loopback interfaces for IPv4 and IPv6, respectively.
ja: o "127.0.0.1" と "::1" は, それぞれ IPv4とIPv6のループバックインタフェイスで受け入れることを意味する.i

source: The format of names and procedures for defining new names are defined in [SSH-ARCH] and [SSH-NUMBERS].
ja: 名前の形式や新しい名前を定義する手続きは, [SSH-ARCH] と [SSH-NUMBERS] で定義されている.

source: These are the tables and objects and their sensitivity/vulnerability:
ja: 以下は, テーブルとオブジェクトとそれらの敏感さ/脆弱性だ.

source: An example of a locally defined name is "ourcipher-cbc@example.com" (without the double quotes).
ja: ローカルに定義される名前の例の1つは, "ourcipher-cbc@example.com" (ダブルクォーテーションを除く) だ.

source: 17 VSTATUS Prints system status line (load, command, pid, etc).
ja: 17 VSTATUS システムのステータス行(負荷, コマンド, pidなど)を表示する.

source: When applicable, the character set for
ja: 可能な場合は, データの文字セットは明示的に指定されなけばならない.

source: o The total fraction of telnet-type data in the Internet is negligible, even with increased packet sizes.
ja: o インターネットでのtelnetタイプのデータの割合は無視できる. たとえ, パケットサイズが増大してもだ.

source: Invocation Counter: A 64-bit integer, incremented after each call to AES-GCM to process an SSH binary packet.
ja: 呼び出し(Invocation) カウンタ: 64-ビット整数. SSH バイナリパケットの処理のために AES-GCM が呼び出されるたびに増加.

source: AES GCM Authenticated Encryption ...........................3 4.2.
ja: AES GCM の認証付き暗号化 ...........................3 4.2.

source: TCP(seq=y, len=500) ----> contains Data
ja: TCP(seq=y, len=500) ----> Data を含む

source: SSH is a protocol for secure remote login and other secure network services over an insecure network.
ja: SSH は, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: The introduction of other non- certificate-based SSH public key formats compatible with the above recommendations is outside the scope of this document.
ja: 以上の勧告と互換する非証明書ベースの SSH 公開鍵形式の導入は, この文書の範囲外だ.

source: The Secure Shell Public Key Subsystem has been designed to run on top of the Secure Shell transport layer [2] and user authentication protocols [3].
ja: セキュアシェル公開鍵サブシステムは, セキュアシェルトランスポート層 [2] と ユーザ認証 [3] プロトコルの上で動作するように設計されている.

source: Inputs: octet_string CT ; // Cipher text, to be both // authenticated and decrypted octet_string AAD; // Additional Authenticated Data, // authenticated only octet_string AT; // Authentication Tag octet_string IV; // Initialization Vector octet_string BK; // Block Cipher Key
ja: Inputs: octet_string CT ; // 認証と復号の両方の暗号文 octet_string AAD; // 追加の認証されるデータ. 認証されるが暗号化されない octet_string AT; // 認証タグ octet_string IV; // 初期化ベクトル octet_string BK; // ブロック暗号の鍵

source: This document also describes the Diffie-Hellman key exchange method and the minimal set of algorithms that are needed to implement the SSH transport layer protocol.
ja: さらに, この文書は, Diffie-Hellman 鍵交換法とSSHトランスポート層プロトコルの実装に必要な最低限のアルゴリズムの集合についても記述する.

source: For example, the authentication protocol ([SSH-USERAUTH]) uses this to prevent replay of signatures from previous sessions.
ja: 例えば, 認証プロトコル ([SSH-USERAUTH]) は, セッション識別子を以前のセッションからの署名のリプレイの防止に利用する.

source: 6) At minLOS_192, all SecSh-B implementations MUST be able to verify ECDSA-384 signatures.
ja: 6) minLOS_192 の場合, すべての SecSh-B 実装は, ECDSA-384 署名を検証できなければならない.

source: The implementation of the SSH connection layer
ja: SSH コネクション層の実装は

source: In this case, the attack device is trying to mimic the legitimate server and will offer its public key to the client when the client initiates a session.
ja: このとき, 攻撃用のデバイスは, 正当なサーバのふりをしようとする. そして, クライアントがセッションを開始しようとする際に, 自らの公開鍵をクライアントに送信する.

source: The exchange proceeds as described in Section 2.1 above, beginning with step 1, except that the exchange hash is computed as described below.
ja: そして交換は， 2.1節で前述したように， ステップ1から始まって進行する． 以下で記述する交換ハッシュの計算は除く．

source: [RFC4253] does not, however, discuss all the problems that could arise if an SSH implementation does not rekey frequently enough.
ja: しかし, [RFC4253] は SSHの実装が十分頻繁に鍵を再生成しない場合におきうるすべての問題については議論していない.

source: The server SHOULD NOT reply with the SSH_MSG_USERAUTH_FAILURE message if the failure is based on the user name or service name; instead, it SHOULD send SSH_MSG_USERAUTH_INFO_REQUEST message(s), which look just like the one(s) that would have been sent in cases where authentication should proceed, and then send the failure message (after a suitable delay, as described below).
ja: ユーザ名かサービス名が原因で失敗したとき, サーバは SSH_MSG_USERAUTH_FAILURE メッセージで応答しないほうがよい. 代わりに, 認証が進む場合のと同様に, SSH_MSG_USERAUTH_INFO_REQUEST メッセージを送る必要がある. そして(後述する適切な遅延の後で)失敗メッセージを送る.

source: Host-Based Authentication ..........................23 9.5.
ja: ホストベース認証 ..........................23 9.5.

source: As a result, allowing GSS-API mechanisms to be used both with and without SPNEGO is undesirable.
ja: 結果として, SPENGO を利用するものと利用しないものの両方を GSS-API メカニズムとして許可するのは望ましくない.

source: It has been modified so that 2 is a generator for the multiplicative group mod p.
ja: pを法とする乗法群 (multiplicative group mod p) に対して2が生成器になるよう修正した.

source: As many bytes as needed are taken from the beginning of the hash value.
ja: 必要なバイト数を, ハッシュの値の最初から取得する.

source: This may be different than a locally cached key identified by the securityName value.
ja: これは, securityName の値で識別されるローカルにキャッシュされた鍵とは異なるかもしれない.

source: The purpose of this protocol is to perform client user authentication.
ja: このプロトコルの目標は, クライアントのユーザ認証を行なうことだ.

source: 7 VEOL2 Additional end-of-line character.
ja: 7 VEOL2 追加の end-of-line 文字.

source: This includes the three authentication methods described in the SSH Authentication Protocol document [RFC4252] (publickey, password, and host-based), keyboard interactive, and others.
ja: これには, SSH 認証プロトコル [RFC4252] に記述された3つの認証法 (publickey, password, host-based) や, keyboard-interactive, それ以外の方法が含まれる.

source: Other methods that could be defined in the future might include storing fingerprints in LDAP or other databases.
ja: 将来, LDAPや他のデータベースに指紋を保存する他の方法が定義されるだろう.

source: Because of the 32-bit counter already present in the protocol, such a counter would only need to be incremented once every 2**32 packets.
ja: 32-bitカウンタがプロトコルですでにあるので, このようなカウンタは, 2**32 パケットごとに一度インクリメントするだけでよいだろう.

source: [BKN1,BKN2] prove that if an SSH application incorporates the methods and recommendations described in this document, then the symmetric cryptographic portion of that application will resist a large class of privacy and integrity attacks.
ja: [BKN1,BKN2] は以下を示している. SSHアプリケーションがこの文書で記述された方法と推薦を組み込めば, アプリケーションの対称暗号の部分は, 秘匿と完全性への攻撃の大部分に抵抗できる.

source: A server receiving this message MUST NOT send an SSH_MSG_USERAUTH_FAILURE in reply, since such a message might otherwise be interpreted by a client as a response to the following authentication sequence.
ja: メッセージを受けとったサーバは, SSH_MSG_USERAUTH_FAILURE を応答として送ってはならない. 次の認証シーケンスに対する応答だとクライアントが解釈してしまう可能性があるからだ.

source: Data Integrity .....................................16 9.3.3.
ja: データの完全性 .....................................16 9.3.3.

source: In particular, implementations MUST NOT omit any of the chain certificates or OCSP responses that were included on the wire, nor change encoding of the certificate or OCSP data.
ja: 特に, 実装は, 通信に含まれた チェーン証明書や OCSP 応答のいずれかを省略してはならないし, 証明書は OCSP データのエンコーディングを変化してはならない.

source: This memo describes a key-exchange mechanism for the version of SSH described in [RFC4251] that is similar to that used by the older version, and about as fast, while retaining the security advantages of the newer protocol.
ja: このメモは, [RFC4251]で記述されているSSHのバージョンのための鍵交換法を記述している. これは古いバージョンで利用しているものと似ていて, 新しいプロトコルのセキュリティの長所を保持しながらも古いバージョンと同じくらい速い.

source: A BREAK signal is defined as the TxD signal being held in a SPACE ("0") state for a time greater than a whole character time.
ja: BREAK シグナルは, 全体のキャラクタ時間よりも長い間 SPACE ("0") 状態を保持する TxD 信号として定義される.

source: ecdh-sha2-nistp256 ephemeral-ephemeral elliptic curve Diffie-Hellman on nistp256 with SHA-256
ja: ecdh-sha2-nistp256 SHA-256 を用いる nistp256 の一時-一時楕円曲線 Diffie-Hellman
